Revit 2027 API
DesignToFabricationConverter.GetConvertedFabricationParts Method
 Gets the set of element identifiers for newly created fabrication parts.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetConvertedFabricationParts()
Public Function GetConvertedFabricationParts As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetConvertedFabricationParts()
member GetConvertedFabricationParts : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
Remarks
 This set of element identifiers is only available after the Convert method has been invoked.
See Also
Reference
DesignToFabricationConverter Class
Autodesk.Revit.DB.Fabrication Namespace